#ifndef DOUBLYLINKEDLIST_H
#define DOUBLYLINKEDLIST_H

//7.2 Реализовать класс DoublyLinkedList, представляющий собой двунаправленный
//список для удобной работы с целыми числами типа int.
//Список методов – такой же, как у односвязного списка, но с учётом возможности
//перемещения по списку в обратном направлении.

//Все методы двунаправленного списка должны быть хорошо протестированы!
//Коды всех тестов должны прилагаться в мейне.

class DoublyLinkedList
{
public:
    DoublyLinkedList();
};

#endif // DOUBLYLINKEDLIST_H
